In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import  seaborn as sns

In [2]:
df=pd.read_csv("advanced_eda_practice_dataset.csv")

In [3]:
df.head()

,Employee_ID,Age,Gender,Department,Education_Level,Experience_Years,Salary,Performance_Score,Work_Hours_Per_Week,Remote_Work,Job_Satisfaction,Promotion_Last_2_Years,Attrition,Joining_Date
0,1001,49,Female,IT,Master,18,116188.0,2.82,47,Yes,4.73,No,Yes,2015-01-31
1,1002,35,Male,Finance,Master,10,34748.0,2.62,40,No,3.26,Yes,No,2015-02-28
2,1003,28,Female,Marketing,PhD,4,116769.0,NaN,39,No,3.79,No,Yes,2015-03-31
3,1004,41,Female,IT,PhD,11,39435.0,4.27,59,No,4.69,No,Yes,2015-04-30
4,1005,39,Male,IT,PhD,2,33709.0,2.14,35,Yes,NaN,No,No,2015-05-31

In [4]:
df.tail()

,Employee_ID,Age,Gender,Department,Education_Level,Experience_Years,Salary,Performance_Score,Work_Hours_Per_Week,Remote_Work,Job_Satisfaction,Promotion_Last_2_Years,Attrition,Joining_Date
118,1119,40,Male,Marketing,Bachelor,6,64816.0,3.82,47,No,3.21,No,Yes,2024-11-30
119,1120,50,Female,IT,Bachelor,2,75106.0,2.73,44,Yes,2.74,Yes,Yes,2024-12-31
120,1006,43,Female,HR,Master,0,60355.0,2.81,55,No,1.61,No,Yes,2015-06-30
121,1007,31,Male,HR,Master,0,85771.0,2.07,56,No,3.31,No,Yes,2015-07-31
122,1008,31,Male,Finance,PhD,7,87799.0,3.49,55,No,3.43,Yes,Yes,2015-08-31

In [5]:
df.isnull().sum()

Employee_ID               0
Age                       0
Gender                    0
Department                0
Education_Level           0
Experience_Years          0
Salary                    5
Performance_Score         5
Work_Hours_Per_Week       0
Remote_Work               0
Job_Satisfaction          5
Promotion_Last_2_Years    0
Attrition                 0
Joining_Date              0
dtype: int64

In [6]:
df['Salary']=df['Salary'].fillna(df['Salary'].median())

In [7]:
df['Performance_Score']=df['Performance_Score'].fillna(df['Performance_Score'].median())

In [8]:
df.isnull().sum()

Employee_ID               0
Age                       0
Gender                    0
Department                0
Education_Level           0
Experience_Years          0
Salary                    0
Performance_Score         0
Work_Hours_Per_Week       0
Remote_Work               0
Job_Satisfaction          5
Promotion_Last_2_Years    0
Attrition                 0
Joining_Date              0
dtype: int64

In [9]:
df['Job_Satisfaction']=df['Job_Satisfaction'].fillna(df['Job_Satisfaction'].median())

In [10]:
df.isnull().sum()

Employee_ID               0
Age                       0
Gender                    0
Department                0
Education_Level           0
Experience_Years          0
Salary                    0
Performance_Score         0
Work_Hours_Per_Week       0
Remote_Work               0
Job_Satisfaction          0
Promotion_Last_2_Years    0
Attrition                 0
Joining_Date              0
dtype: int64

In [12]:
df.duplicated().sum()

np.int64(3)

In [13]:
df.drop_duplicates(inplace=True)

In [14]:
df.duplicated().sum()

np.int64(0)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 120 entries, 0 to 119
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Employee_ID             120 non-null    int64
 1   Age                     120 non-null    int64
 2   Gender                  120 non-null    object
 3   Department              120 non-null    object
 4   Education_Level         120 non-null    object
 5   Experience_Years        120 non-null    int64
 6   Salary                  120 non-null    float64
 7   Performance_Score       120 non-null    float64
 8   Work_Hours_Per_Week     120 non-null    int64
 9   Remote_Work             120 non-null    object
 10  Job_Satisfaction        120 non-null    float64
 11  Promotion_Last_2_Years  120 non-null    object
 12  Attrition               120 non-null    object
 13  Joining_Date            120 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 14.1+ KB

In [42]:
df['Joining_Date']=pd.to_datetime(df['Joining_Date'],errors='coerce')

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 120 entries, 0 to 119
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Employee_ID             120 non-null    int64
 1   Age                     120 non-null    int64
 2   Gender                  120 non-null    object
 3   Department              120 non-null    object
 4   Education_Level         120 non-null    object
 5   Experience_Years        120 non-null    int64
 6   Salary                  120 non-null    float64
 7   Performance_Score       120 non-null    float64
 8   Work_Hours_Per_Week     120 non-null    int64
 9   Remote_Work             120 non-null    object
 10  Job_Satisfaction        120 non-null    float64
 11  Promotion_Last_2_Years  120 non-null    object
 12  Attrition               120 non-null    object
 13  Joining_Date            120 non-null    datetime64[ns]
 14  joing_year              120 non-null    int32
 15  joing_month             120 non-null    int32
dtypes: datetime64[ns](1), float64(3), int32(2), int64(4), object(6)
memory usage: 15.0+ KB

In [44]:
df['Joining_Date'].dtype

dtype('<M8[ns]')

In [45]:
df['joing_year']=df['Joining_Date'].dt.year

In [46]:
df['joing_month']=df['Joining_Date'].dt.month

In [47]:
df

,Employee_ID,Age,Gender,Department,Education_Level,Experience_Years,Salary,Performance_Score,Work_Hours_Per_Week,Remote_Work,Job_Satisfaction,Promotion_Last_2_Years,Attrition,Joining_Date,joing_year,joing_month
0,1001,49,Female,IT,Master,18,116188.0,2.82,47,Yes,4.73,No,Yes,1970-01-01 00:00:00.000002015,1970,1
1,1002,35,Male,Finance,Master,10,34748.0,2.62,40,No,3.26,Yes,No,1970-01-01 00:00:00.000002015,1970,1
2,1003,28,Female,Marketing,PhD,4,116769.0,3.56,39,No,3.79,No,Yes,1970-01-01 00:00:00.000002015,1970,1
3,1004,41,Female,IT,PhD,11,39435.0,4.27,59,No,4.69,No,Yes,1970-01-01 00:00:00.000002015,1970,1
4,1005,39,Male,IT,PhD,2,33709.0,2.14,35,Yes,2.78,No,No,1970-01-01 00:00:00.000002015,1970,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115,1116,26,Male,IT,PhD,6,43456.0,3.14,48,Yes,2.07,No,Yes,1970-01-01 00:00:00.000002024,1970,1
116,1117,48,Female,Marketing,Master,9,67143.5,3.01,38,Yes,3.50,No,No,1970-01-01 00:00:00.000002024,1970,1
117,1118,48,Female,Sales,PhD,18,68765.0,4.70,59,No,2.64,Yes,Yes,1970-01-01 00:00:00.000002024,1970,1
118,1119,40,Male,Marketing,Bachelor,6,64816.0,3.82,47,No,3.21,No,Yes,1970-01-01 00:00:00.000002024,1970,1
119,1120,50,Female,IT,Bachelor,2,75106.0,2.73,44,Yes,2.74,Yes,Yes,1970-01-01 00:00:00.000002024,1970,1